from bin.add_model_repair import *


url = 'http://192.168.221.21'
username = 'admin'
password = '1234'
contents = ['全寿命周期费用分析','系统部件维度']

# url = 'http://101.201.113.42'
min_model = [['m1','2017-03-02','2017-05-04',{'E27':'all'
       },{'E27':[{'构型62':{'构型70':['构型30']}},['构型53']]},{'内装系统':['南京勃朗峰']}],['m2','2017-05-02','2017-08-04',{'E27':'all'
       },{'E27':[{'构型62':{'构型70':['构型30']}},['构型53']]},{'内装系统':['南京勃朗峰']}]]
# min_model = [["m1", "170", "190", {'E27': ['2651'], 'E28': ['2216']}
# ], ['m2', '170', '190', {'E27': ['2651'], 'E28': ['2216']}]]


# min_model = [["m1", "2017-03-01", "2017-05-01", {'17型车': ['170770'], '18型车': ['180274']}
# ], ['m2', '2017-03-01', '2017-05-01', {'17型车': ['170770'], '18型车': ['180274']}]]

# min_model = [["m1", "170", "190", {'17型车': ['170770'], '18型车': ['180274']}
# ], ['m2', '170', '190', {'17型车': ['170770'], '18型车': ['180274']}]]

wait_time = 10

# min_model = ['1217','yx']

add_model(url,username,password,contents,'0911测试时间','ol','','新建','时间',min_model,wait_time)

# revise(url,contents,'0911测试时间','时间',min_model,wait_time)